from selenium.webdriver.common.keys import Keys
from selenium import webdriver
from bs4 import BeautifulSoup
import time
import csv
import re

tw_area_ls = [ '台北市松山區', '台北市大安區', '台北市中正區' , '台北市大同區', '台北市中山區',
              '台北市萬華區', '台北市信義區', '台北市士林區', '台北市北投區', '台北市內湖區', 
              '台北市南港區', '台北市文山區', '基隆市仁愛區', '基隆市信義區', '基隆市中正區', 
              '基隆市中山區', '基隆市安樂區', '基隆市暖暖區', '基隆市七堵區', '新北市萬里區', 
              '新北市金山區', '連江縣南竿鄉', '連江縣北竿鄉', '連江縣莒光鄉', '連江縣東引鄉', 
              '新北市板橋區', '新北市汐止區', '新北市深坑區', '新北市石碇區', '新北市瑞芳區', 
              '新北市平溪區', '新北市雙溪區', '新北市貢寮區', '新北市新店區', '新北市坪林區', 
              '新北市烏來區', '新北市永和區', '新北市中和區', '新北市土城區', '新北市三峽區', 
              '新北市樹林區', '新北市鶯歌區', '新北市三重區', '新北市新莊區', '新北市泰山區', 
              '新北市林口區', '新北市蘆洲區', '新北市五股區', '新北市八里區', '新北市淡水區', 
              '新北市三芝區', '新北市石門區', '宜蘭縣宜蘭市', '宜蘭縣頭城鎮', '宜蘭縣礁溪鄉', 
              '宜蘭縣壯圍鄉', '宜蘭縣員山鄉', '宜蘭縣羅東鎮', '宜蘭縣三星鄉', '宜蘭縣大同鄉', 
              '宜蘭縣五結鄉', '宜蘭縣冬山鄉', '宜蘭縣蘇澳鎮', '宜蘭縣南澳鄉', '宜蘭縣釣魚台', 
              '新竹市', '新竹縣竹北市', '新竹縣湖口鄉', '新竹縣新豐鄉', '新竹縣新埔鎮', 
              '新竹縣關西鎮', '新竹縣芎林鄉', '新竹縣寶山鄉', '新竹縣竹東鎮', '新竹縣五峰鄉', 
              '新竹縣橫山鄉', '新竹縣尖石鄉', '新竹縣北埔鄉', '新竹縣峨眉鄉', '桃園市中壢區', 
              '桃園市平鎮區', '桃園市龍潭區', '桃園市楊梅區', '桃園市新屋區', '桃園市觀音區', 
              '桃園市桃園區', '桃園市龜山區', '桃園市八德區', '桃園市大溪區', '桃園市復興區', 
              '桃園市大園區', '桃園市蘆竹區', '苗栗縣竹南鎮', '苗栗縣頭份鎮', '苗栗縣三灣鄉', 
              '苗栗縣南庄鄉', '苗栗縣獅潭鄉', '苗栗縣後龍鎮', '苗栗縣通霄鎮', '苗栗縣苑裡鎮', 
              '苗栗縣苗栗市', '苗栗縣造橋鄉', '苗栗縣頭屋鄉', '苗栗縣公館鄉', '苗栗縣大湖鄉', 
              '苗栗縣泰安鄉', '苗栗縣銅鑼鄉', '苗栗縣三義鄉', '苗栗縣西湖鄉', '苗栗縣卓蘭鎮', 
              '台中市中區', '台中市東區', '台中市南區', '台中市西區', '台中市北區', '台中市北屯區', 
              '台中市西屯區', '台中市南屯區', '台中市太平區', '台中市大里區', '台中市霧峰區', 
              '台中市烏日區', '台中市豐原區', '台中市后里區', '台中市石岡區', '台中市東勢區', 
              '台中市和平區', '台中市新社區', '台中市潭子區', '台中市大雅區', '台中市神岡區', 
              '台中市大肚區', '台中市沙鹿區', '台中市龍井區', '台中市梧棲區', '台中市清水區', 
              '台中市大甲區', '台中市外埔區', '台中市大安區', '彰化縣彰化市', '彰化縣芬園鄉', 
              '彰化縣花壇鄉', '彰化縣秀水鄉', '彰化縣鹿港鎮', '彰化縣福興鄉', '彰化縣線西鄉', 
              '彰化縣和美鎮', '彰化縣伸港鄉', '彰化縣員林市', '彰化縣社頭鄉', '彰化縣永靖鄉', 
              '彰化縣埔心鄉', '彰化縣溪湖鎮', '彰化縣大村鄉', '彰化縣埔鹽鄉', '彰化縣田中鎮', 
              '彰化縣北斗鎮', '彰化縣田尾鄉', '彰化縣埤頭鄉', '彰化縣溪州鄉', '彰化縣竹塘鄉', 
              '彰化縣二林鎮', '彰化縣大城鄉', '彰化縣芳苑鄉', '彰化縣二水鄉', '南投縣南投市', 
              '南投縣中寮鄉', '南投縣草屯鎮', '南投縣國姓鄉', '南投縣埔里鎮', '南投縣仁愛鄉', 
              '南投縣名間鄉', '南投縣集集鎮', '南投縣水里鄉', '南投縣魚池鄉', '南投縣信義鄉', 
              '南投縣竹山鎮', '南投縣鹿谷鄉', '嘉義市', '嘉義縣番路鄉', '嘉義縣梅山鄉', '嘉義縣竹崎鄉',
              '嘉義縣阿里山', '嘉義縣中埔鄉', '嘉義縣大埔鄉', '嘉義縣水上鄉', '嘉義縣鹿草鄉', 
              '嘉義縣太保市', '嘉義縣朴子市', '嘉義縣東石鄉', '嘉義縣六腳鄉', '嘉義縣新港鄉',
              '嘉義縣民雄鄉', '嘉義縣大林鎮', '嘉義縣溪口鄉', '嘉義縣義竹鄉', '嘉義縣布袋鎮', 
              '雲林縣斗南鎮', '雲林縣大埤鄉', '雲林縣虎尾鎮', '雲林縣土庫鎮', '雲林縣褒忠鄉', 
              '雲林縣東勢鄉', '雲林縣台西鄉', '雲林縣崙背鄉', '雲林縣麥寮鄉', '雲林縣斗六市', 
              '雲林縣林內鄉', '雲林縣古坑鄉', '雲林縣莿桐鄉', '雲林縣西螺鎮', '雲林縣二崙鄉', 
              '雲林縣北港鎮', '雲林縣水林鄉', '雲林縣口湖鄉', '雲林縣四湖鄉', '雲林縣元長鄉', 
              '台南市中西區', '台南市東區', '台南市南區', '台南市西區', '台南市北區', '台南市安平區', 
              '台南市安南區', '台南市永康區', '台南市歸仁區', '台南市新化區', '台南市左鎮區', 
              '台南市玉井區', '台南市楠西區', '台南市南化區', '台南市仁德區', '台南市關廟區', 
              '台南市龍崎區', '台南市官田區', '台南市麻豆區', '台南市佳里區', '台南市西港區', 
              '台南市七股區', '台南市將軍區', '台南市學甲區', '台南市北門區', '台南市新營區', 
              '台南市後壁區', '台南市白河區', '台南市東山區', '台南市六甲區', '台南市下營區', 
              '台南市柳營區', '台南市鹽水區', '台南市善化區', '台南市大內區', '台南市山上區', 
              '台南市新市區', '台南市安定區', '高雄市新興區', '高雄市前金區', '高雄市苓雅區', 
              '高雄市鹽埕區', '高雄市鼓山區', '高雄市旗津區', '高雄市前鎮區', '高雄市三民區', 
              '高雄市楠梓區', '高雄市小港區', '高雄市左營區', '高雄市仁武區', '高雄市大社區', 
              '南海島東沙群島', '南海島南沙群島', '高雄市岡山區', '高雄市路竹區', '高雄市阿蓮區', 
              '高雄市田寮區', '高雄市燕巢區', '高雄市橋頭區', '高雄市梓官區', '高雄市彌陀區', 
              '高雄市永安區', '高雄市湖內區', '高雄市鳳山區', '高雄市大寮區', '高雄市林園區', 
              '高雄市鳥松區', '高雄市大樹區', '高雄市旗山區', '高雄市美濃區', '高雄市六龜區', 
              '高雄市內門區', '高雄市杉林區', '高雄市甲仙區', '高雄市桃源區', '高雄市那瑪夏區',
              '高雄市茂林區', '高雄市茄萣區', '澎湖縣馬公市', '澎湖縣西嶼鄉', '澎湖縣望安鄉',
              '澎湖縣七美鄉', '澎湖縣白沙鄉', '澎湖縣湖西鄉', '金門縣金沙鎮', '金門縣金湖鎮', 
              '金門縣金寧鄉', '金門縣金城鎮', '金門縣烈嶼鄉', '金門縣烏坵鄉', '屏東縣屏東市', 
              '屏東縣三地門', '屏東縣霧台鄉', '屏東縣瑪家鄉', '屏東縣九如鄉', '屏東縣里港鄉', 
              '屏東縣高樹鄉', '屏東縣鹽埔鄉', '屏東縣長治鄉', '屏東縣麟洛鄉', '屏東縣竹田鄉', 
              '屏東縣內埔鄉', '屏東縣萬丹鄉', '屏東縣潮州鎮', '屏東縣泰武鄉', '屏東縣來義鄉', 
              '屏東縣萬巒鄉', '屏東縣崁頂鄉', '屏東縣新埤鄉', '屏東縣南州鄉', '屏東縣林邊鄉', 
              '屏東縣東港鎮', '屏東縣琉球鄉', '屏東縣佳冬鄉', '屏東縣新園鄉', '屏東縣枋寮鄉', 
              '屏東縣枋山鄉', '屏東縣春日鄉', '屏東縣獅子鄉', '屏東縣車城鄉', '屏東縣牡丹鄉', 
              '屏東縣恆春鎮', '屏東縣滿州鄉', '台東縣台東市', '台東縣綠島鄉', '台東縣蘭嶼鄉', 
              '台東縣延平鄉', '台東縣卑南鄉', '台東縣鹿野鄉', '台東縣關山鎮', '台東縣海端鄉', 
              '台東縣池上鄉', '台東縣東河鄉', '台東縣成功鎮', '台東縣長濱鄉', '台東縣太麻里', 
              '台東縣金峰鄉', '台東縣大武鄉', '台東縣達仁鄉', '花蓮縣花蓮市', '花蓮縣新城鄉', 
              '花蓮縣秀林鄉', '花蓮縣吉安鄉', '花蓮縣壽豐鄉', '花蓮縣鳳林鎮', '花蓮縣光復鄉', 
              '花蓮縣豐濱鄉', '花蓮縣瑞穗鄉', '花蓮縣萬榮鄉', '花蓮縣玉里鎮', '花蓮縣卓溪鄉', 
              '花蓮縣富里鄉'
              ]
# '麵包','酒吧', '醫院', '蔬果店','水果批發商','冰品飲料店','水管用品店','浴室用品店','水電承辦商','水匠','居家用品店',
            #'五金用品店','工具店','餐廳','小吃','冰品店','早餐', '羊肉爐', '菸酒', '鞋店','洗衣店','3c 賣場','輪胎','手機','剪髮',
            #'國術館','寵物醫院','園藝','留學服務','開鎖'

kinds_ls = ['房地產仲介','冷凍食品','便當店','光學儀器','家具','出版社','銀樓',
            '工業設計','室內設計','安親班','五金行','駕訓班','彩券行','水族館','會計事務所','律師事務所','婚紗禮服','命理卜卦',
            '電影院','眼鏡行','水塔','飯店','銀行','游泳池','人力仲介','動物醫院','郵局','資源回收','加油站','輪胎','補習班','報社',
            '旅行社','花市','自行車','中醫','招牌','徵信社','蟲害防治','清潔用品','公會','體育','鋼鐵','加工','食品','賣場',
            '土產品', '醬油蠔油', '辦桌外燴', '食用油', '便當餐盒', '餐飲設備用品', '皮衣', '手帕', '機車','門市','鞋店','拉鍊',
            '衣架吊架', '毛衣', '男裝', '布行', '二手衣', '孕婦裝', '流行服飾', '大理石', '營建工程', '木工', '設備',
            '瓦斯爐', '地毯', '水塔', '三溫暖設備', '園藝器具資材', '工程檢測', '保全監視系統', '水處理', '建築模型與繪圖', 
            '電梯', '精品百貨', '製造', '家庭雜貨', '一元商品', '氣象服務', '郵政服務', '電力服務', '消防','動物','大學','按摩',
            '個性化商店', '化粧品', '珠寶', '禮贈品製造', '藝品', '玩具製造', '餐具製造', '沐浴用品', '貴金屬', 
            '工藝材料', '人造花', '防身器材', '二手家電', '幼兒園', '科學館', '圖書設備及用品', '電路板','寶特瓶',
            '學術研究機構', '訓練課程', '課輔安親', '泡湯', '羽球館', '馬術', '戲劇製作','舞蹈', '釣蝦',
            '水上運動', '古玩藝品', '樂器', '撲克牌、紙牌', '裱框', '電影器材', '武術道館', 'DRAM','晶圓','封裝',
            '旅遊景點', '體育' , '電視節', '報社', '廣播電台', '傳播公司', '行銷','代工','金融','鍛造',
            '教具', '汽車零配件', '貨運', '自行車出租', '飛機修理保養', '吊車', '倉庫', '水肥','體育用品',
            '搬運起重服務', '加油站設備', '停車場', '工程', '安全帽', '監理所', '汽車拖吊服務', 
            '報關業', '計程車', '快遞服務', '污水處理', '廢土處理', '清潔服務', '環保組織', '道路救援'
            '焚化設備', '資源回收', '印刷材料', '商標', '印章', '陳列設計', '公關顧問', '工商服務', 
            '投資服務', '銀行','應收帳款管理', '移民服務', '展覽服務','律師', '專利', '人力仲介', 
            '資料處理', '個人工作室', '公證服務', '當舖', '免稅商店','工商日誌', '辦公事務機', '教育用品', 
            '影印服務', '辦公傢俱', '投影機', '錄影帶', '有線電視', '視聽製作', 
            '眼鏡、隱形眼鏡', '鐘錶製造', '數位錄放設備', '電腦版卡', '光碟片','磁帶', '光纖通信', '電腦', '網路', 
            '廣播系統', '路由器', '多媒體設計', '對講機', '電腦機房設備', '航太科技', '電腦軟體', '塑膠袋', '包裝設計', 
            '包裝材料', '包裝機', '保險絲', '半導體', '抽水機', '冷凍設備', '電熱', '電池製造', '燈具', '不織布', '尼龍', 
            '棉紗', '印花', '人造纖維', '人造纖維原料', '造紙', '塑膠原料', '合成皮', '香精', '油漆', '油', 
            '玻璃製造', '殺蟲劑', '溶劑', '瓦斯業', '氣體', '農藥', '能源設備', '機械加工', '燈泡機械', '自動化機械', '工具機', 
            '空油壓機械', '紡織機械', '塑膠成型機', '印刷機械', '皮革加工機械', '塗裝機械', '輸送設備', 
            '集塵吸塵設備', '機械零配件', '工業安全器材', '農機設備', '營建機械', '木工機械', '化工機械', '工業用爐', '整廠設備', 
            '金屬冶煉', '不銹鋼材料', '剪刀', '模具', '熱處理', '五金廢料', '木材', '果園、農場', 
            '石礦', '水產養殖', '皮革、毛皮', '農事服務', '美容設備', '復健器材', '藥商', '民俗療法', '安養中心', 
            '衛生用品製造', '動物藥品', '生物科技', '衛生機關','檢驗所', '醫療器材', '醫療服務', '醫療矯正訓練', '減肥塑身', 
            '宗教物品', '民眾服務社', '水利會','社會團體', '婚姻介紹', '社福機構', '社區組織', '老人安養院', '殯葬服務', 
            '香燭紙料', '靈骨塔', '電信服務', '縣市政府機關', '瓦斯服務', '石油服務', '自來水服務' 
            ]
# 電器,通訊,被動元件,貿易,腳踏車
# 解析店家資訊
def parser_web(driver):
    soup = BeautifulSoup(driver.page_source, 'html.parser')
    address_class = soup.find_all("span",attrs={"class": "widget-pane-link"})
    kind_class = soup.find_all("button",attrs={"class": "widget-pane-link"})

    kind_ls = []
    for k in kind_class:
        k = k.text
        # 判斷中文字
        zhPattern = re.compile(u'[\u4e00-\u9fa5]+')
        match = zhPattern.search(k)
        if k != '':
            if match:
                kind_ls += [k]

    infor_ls = []
    for information in address_class:
        infor = information.text
        if infor != '':
            infor_ls += [infor]
    
    phone_ls = [] 
    for a in address_class:
        a = a.text.replace(" ","")
        m = re.findall("\d{8,10}",a)
        if m != []:
            m = "".join(m)
            phone_ls += [m]
    
    title = soup.find("title").text.replace(" - Google 地圖","")
    address = infor_ls[0]
    phone = "".join(phone_ls)

    try:
        kind = kind_ls[0]
    except:
        kind = 'Na'
    
    return title,address,phone,kind

def judge_ad(driver):
    soup = BeautifulSoup(driver.page_source, 'html.parser')
    ad_class = soup.find_all("button")

    ad_str_ls = []
    for i in ad_class:
        i = i.get('title')
        if i == 'Why this ad?':
            ad_str_ls += [i]
    
    ad_num = len(ad_str_ls)
    
    return ad_num,driver


def map_information(num,driver):
    # 翻頁範圍
    
    for n in range(1,20):
        print("page->> "+ str(n))
        # 店家列表
        for i in range(num,50,2):
            try:

                time.sleep(5)
                driver.find_element_by_css_selector("#pane > div > div.widget-pane-content.scrollable-y > div > div > div.section-layout.section-scrollbox.scrollable-y.scrollable-show.section-layout-flex-vertical > div:nth-child("+ str(i) +") > div.section-result-content > div.section-result-text-content > div.section-result-header > div.section-result-title-container > h3 > span").click()
                time.sleep(5)
                                                  
                ##### 處理店家地址、電話 #####
                title,address,phone,kind = parser_web(driver)

                ############################

                # 二維表格
                table = [
                    [title, 'Na', phone, 'Na', address, area,'Na','Na','Na','Na',kind],
                ]

                with open('./google_map.csv', 'a', newline='', encoding='utf-8') as csvfile:
                    writer = csv.writer(csvfile)
                    writer.writerows(table)

                driver.find_element_by_css_selector("#pane > div > div.widget-pane-content.scrollable-y > div > div > button > span").click() # 返回按鈕
                time.sleep(5)

            except Exception as e:
                print(e)
                break

        try:
            driver.find_element_by_css_selector("#n7lv7yjyC35__section-pagination-button-next").click() # 下一頁
        except Exception as e:
            print(e)
            break

path = 'chromedriver.exe'
link = 'https://www.google.com.tw/maps'
driver = webdriver.Chrome(executable_path = path)

# 主程式
for kinds in kinds_ls:
    for area in tw_area_ls:
        keyword = area + " " + kinds
        driver.get(link)
        driver.implicitly_wait(30)
        driver.find_element_by_css_selector("#searchboxinput").send_keys(keyword) # 輸入關鍵字
        driver.find_element_by_id("searchbox-searchbutton").click() # 點選搜尋
        time.sleep(3)
        
        # 判斷廣告數量
        ad_number,driver = judge_ad(driver)
        
        if ad_number == 0:
            num = 1
            map_information(num,driver)
        elif ad_number == 1:
            num = 3
            map_information(num,driver)
        elif ad_number == 2:
            num = 5
            map_information(num,driver)
        elif ad_number == 3:
            num = 7
            map_information(num,driver)
       
        
driver.close()
driver.quit()

